import streamlit as st

st.set_page_config(page_title = "Машинное обучение")

st.sidebar.success("Машинное обучение")

st.write("# Машинное обучение")

st.write(r"""Машинное обучение (Machine Learning) — это область искусственного интеллекта, которая изучает разработку и применение алгоритмов 
и моделей, позволяющих компьютерам обучаться на основе опыта и данных, и делать прогнозы и принимать решения. 

Машинное обучение находит применение во многих областях, включая распознавание образов, 
обработку естественного языка, управление данными, финансы и многое другое.""")
