import streamlit as st

st.set_page_config(page_title = "Проблема")

st.sidebar.success("Проблема")

st.write("# Проблема")

st.write(r"""MAB (Multi-Armed Bandit) алгоритмы решают проблему выбора оптимальной 
         стратегии в условиях неопределенности и ограниченных ресурсов. Они находят 
         широкое применение в анализе данных, позволяя эффективно балансировать 
         исследование (exploration) и эксплуатацию (exploitation) доступных вариантов 
         действий, чтобы максимизировать собранную информацию или полученную награду.
""")

st.write(r"""В современной сфере WEB-индустрии существует проблема обучения 
         рекомендательных систем во время их работы. В таких системах отклик 
         на действия пользователя является случайной и непредсказуемой величиной. 
         Параметры этого отклика изначально неизвестны и могут изменяться в процессе 
         работы системы. В связи с этим возникает необходимость в решении задачи 
         «обучения с подкреплением». """)

st.markdown("""
MAB алгоритмы используются:
1. В рекомендательных системах, например, Spotify
2. Для оптимизации контекстуальной рекламы
3. В клинических испытаниях
4. Для активного обучения
5. В интернет-маркетинге
""")