import streamlit as st

st.set_page_config(page_title = "Объект")

st.sidebar.success("Объект")

st.write("# Объект")

st.write(r"""Объектом исследования данной работы является алгоритмы многоруких 
         бандитов, которые используются в задачах выбора действий с неопределенным 
         результатом, таких как машинное обучение. """)

st.write(r"""Многорукие бандиты — это класс алгоритмов машинного обучения, которые 
         используются для решения задач оптимизации при принятии решений в условиях 
         неопределенности, другими словами, в ситуациях, где имеется несколько вариантов 
         выбора и каждый выбор имеет свою вероятность успеха. """)

st.write(r"""        
         В основе алгоритмов многоруких бандитов лежит идея баланса между исследованием и 
         эксплуатацией. Алгоритм должен исследовать все возможные варианты выбора, чтобы получить 
         максимально возможный доход, но при этом он должен также использовать уже найденные 
         эффективные варианты, чтобы не потерять уже заработанные деньги.
         """)
