import streamlit as st

st.set_page_config(page_title = "Цель работы")

st.sidebar.success("Цель работы")

st.write("# Цель работы")

st.write(r"""Целью магистерской диссертации является исследование алгоритмов многоруких 
         бандитов и их применение в задаче оптимизации выбора.""")

st.markdown("""
Цели:
1. Программная реализация 3-х алгоритмов «обучения с подкреплением».- epsilon-greedy, UCB, алгоритм Томпсона.
2. Разработка метрик оптимальности.
3. Численное исследование сходимости различных алгоритмов «обучения с подкреплением» к оптимальному решению.
""")
