import streamlit as st

st.set_page_config(page_title = "Задачи по диссертации")

st.sidebar.success("Задачи по диссертации")

st.write("# Задачи по диссертации")

st.markdown("""
1.	Постановка задачи «обучения с подкреплением».
2.	Проблема «обучения-использования».
3.	Метрики сходимости алгоритмов «обучения с подкреплением» к оптимальному решению.
4.	Алгоритм epsilon-greedy.
5.	Алгоритм UCB.
6.	Алгоритм Томпсона.
7.	Численное исследование сходимости различных алгоритмов «обучения с подкреплением» к оптимальному решению.
8.	Программная реализация алгоритмов и метрик.
         """)
