import streamlit as st

st.set_page_config(page_title = "Укрупненный план работы ")

st.sidebar.success("Укрупненный план работы ")

st.write("# Укрупненный план работы ")

st.markdown("""
## Первый семестр:
1.	Постановка задачи «обучения с подкреплением».
2.	Проблема «обучения-использования».
3.	Метрики сходимости алгоритмов «обучения с подкреплением» к оптимальному решению.
4.	Алгоритм epsilon-greedy.
5.	Алгоритм UCB.

## Второй семестр:
1.	Алгоритм Томпсона.
2.	Численное исследование сходимости различных алгоритмов «обучения с подкреплением» к оптимальному решению.
3.	Программная реализация алгоритмов и метрик.
4.	Подготовка магистерской диссертации.
""")
