import streamlit as st

st.set_page_config(page_title = "Объем работы")

st.sidebar.success("Объем работы")

st.write("# Объем работы")

st.markdown("""
## Объем работы: минимальный
1.	Постановка задачи «обучения с подкреплением».
2.	Проблема «обучения-использования».
3.	Метрики сходимости алгоритмов «обучения с подкреплением» к оптимальному решению.
4.	Алгоритм epsilon-greedy.

## Объем работы: основной
1.	Постановка задачи «обучения с подкреплением».
2.	Проблема «обучения-использования».
3.	Метрики сходимости алгоритмов «обучения с подкреплением» к оптимальному решению.
4.	Алгоритм epsilon-greedy.
5.	Алгоритм UCB.
6.	Алгоритм Томпсона.
7.	Программная реализация алгоритмов и метрик.


## Объем работы: расширенный
1.	Постановка задачи «обучения с подкреплением».
2.	Проблема «обучения-использования».
3.	Метрики сходимости алгоритмов «обучения с подкреплением» к оптимальному решению.
4.	Алгоритм epsilon-greedy.
5.	Алгоритм UCB.
6.	Алгоритм Томпсона.
7.	Программная реализация алгоритмов и метрик. 
8.  Численное исследование сходимости различных алгоритмов «обучения с подкреплением» к оптимальному решению.
""")
