import streamlit as st

st.set_page_config(page_title = "Описание работы")

st.sidebar.success("Описание работы")

st.write("# Описание работы")

st.markdown(
        """
        ### Методы решение задачи
        Будут использованы методы статистического моделирования и язык программирования Python
        
        ### Научная новизна 
        Численное исследование асимптотических свойств алгоритмов MAB
        
        ### Практическая значимость 
        Повышение эффективности веб-маркетинга""")