import streamlit as st

st.set_page_config(page_title = "Принцип работы алгоритмов многоруких бандитов")

st.sidebar.success("Принцип работы алгоритмов многоруких бандитов")

st.write("# Принцип работы алгоритмов многоруких бандитов")

st.markdown(
        """ ### Принцип работы алгоритмов:
1. Выбрать руку;
2. Получить вознаграждение;
3. Запомнить выбранную руку.
""")

st.markdown(
        """ ### При  исследовании алгоритмов можно использовать различные метрики:
1. Вероятность выбора оптимальной руки;
2. Среднее вознаграждение;
3. Суммарное вознаграждение;
4. Совокупное сожаление (total regret).
""")

st.markdown(
        """
$$
R_{T}=\sum_{i=1}^{T}(w_{opt}-w_{i})=Tw_{opt}-\sum_{i=1}^{T}w_{i}
$$
""")
