import streamlit as st

st.set_page_config(page_title = "Машинное обучение")

st.sidebar.success("Машинное обучение")

st.write("# Машинное обучение")

st.write(r"""Машинное обучение (Machine Learning) — это область искусственного интеллекта, 
которая позволяет компьютерным системам проявлять интеллектуальную активность в процессе получения 
знаний и опыта. 

Основная задача машинного обучения заключается в том, чтобы обучить компьютерную 
систему распознавать закономерности и отношения на основе исходных данных, которые затем могут быть 
использованы для того, чтобы принимать решения.""")
