import streamlit as st

st.set_page_config(page_title = "Актуальность темы")

st.sidebar.success("Актуальность темы")

st.write("# Актуальность темы")

st.write(r"""Исследование алгоритмов многоруких бандитов (Multi-Armed Bandit, MAB) 
является актуальным во многих областях, где необходимо принимать решения на основе 
ограниченной информации, в том числе в экономике, маркетинге, медицине, телекоммуникациях 
и других. 

Таким образом, исследование алгоритмов многоруких бандитов является актуальным и 
востребованным направлением, позволяющим разработать эффективные решения для задач при
ограниченной и неполной информации.""")

st.markdown(
        """
## Количество публикации о MAB в области рекомендаций
""")

from PIL import Image
image = Image.open('2.png')
st.image(image)
