import streamlit as st

st.set_page_config(page_title = "Цели и задачи")

st.sidebar.success("Цели и задачи")

st.write("# Цели и задачи")

st.write(r"""Целью данной курсовой работы является исследование $\epsilon$-greedy алгоритма и его применение в задаче оптимизации выбора.

Задачи курсовой:
1. Проанализировать исследования и статьи по проблеме многоруких бандитов в теории вероятности и в машинном обучении;
2. Написать программную реализацию $\epsilon$-greedy алгоритма на языке Python;
3. Провести исследование алгоритма.

""")
