import streamlit as st

st.set_page_config(page_title = "Дилемма исследования и использования")

st.sidebar.success("Дилемма исследования и использования")

st.write("# Дилемма исследования и использования")

st.write(r"""Дилемма исследования и использования в алгоритмах многоруких бандитов заключается в том, что алгоритм должен 
выбрать между оптимизацией своего решения на основе текущих знаний и исследованием неизвестных возможностей 
для получения новых знаний.""")
         
st.write(r"""Bозникает необходимость балансирования между двумя задачами: принятием решений на основе имеющихся данных и получением новой информации для улучшения будущих решений.
""")

#st.markdown("""
        #### Для эффективной работы нужно искать компромисс между исследованием и использованием, так как исследование приводит к денежным тратам, но может помочь выбрать наилучший вариант, а использование может привести к стагнации, если будет использовать неэффективный вариант, или лучший вариант, в ходе его использования, перестал таким являться.""")
