import streamlit as st

st.set_page_config(page_title = "Актуальность темы")

st.sidebar.success("Актуальность темы")

st.write("# Актуальность темы")

st.write(r"""Методы многоруких бандитов (MAB - Multi-Armed Bandit) являются подклассам задач анализа 
             данных и в настоящее время стали неотъемлемой частью веб-маркетинга. Задачи оптимизации показа рекламы 
             (максимизации конверсий, кликабельности и т.д.) довольно подробно изучены в то время, как задачи максимизации 
             продажной выручки не получают большого распространения на практике из-за некоторой сложности. Актуальность 
             темы диссертационной работы обусловлена необходимостью исследования свойств алгоритмов оптимизации продажной 
             выручки при использовании веб-рекламы.""")
