import streamlit as st

st.set_page_config(page_title = "Задача о многоруком бандите")

st.sidebar.success("Задача о многоруком бандите")

st.write("# Задача о многоруком бандите")

st.write(r"""Задача о многоруком бандите – одна из самых основных задач в науке о решениях. А именно, это задача об 
        оптимальном распределении ресурсов в уcловиях неопределенности.""")

st.write(r"""
        Проблема в следующем: как нам эффективнее всего понять, какая машина подходит лучше всего, и при этом перепробовать 
        много возможностей в реальном времени?""")
