import streamlit as st

st.set_page_config(page_title = "Исследовать и использовать")

st.sidebar.success("Исследовать и использовать")

st.write("# Исследовать и использовать (Explore and exploit)")

st.write(r"""Пространство вариантов надо исследовать, чтобы иметь понятие 
         о том, какой вариант самый лучший. Мы хотим застраховаться против возможных 
         убытков, пробуя немного экспериментировать с субоптимальными вариантами, чтобы уточнить для себя их 
         окупаемость. Если их окупаемость на самом деле более высокая, их можно показывать чаще. Другой плюс от 
         исследования вариантов в том, что мы можем лучше понять не только среднюю окупаемость, но и то, как 
         примерно окупаемость распределяется, т.е мы можем лучше оценить неопределенность.""")

st.markdown(
        """
        ### Следовательно, главная проблема – это решить, как лучше всего выйти из дилеммы между исследованием и использованием (exploration-exploitation tradeoff).""")
