import streamlit as st

st.set_page_config(page_title = "Эпсилон-жадный алгоритм")

st.sidebar.success("Эпсилон-жадный алгоритм")

st.write("# Эпсилон-жадный алгоритм (epsilon-greedy algorithm)")

st.write(r"""Типичный способ выйти из этой дилеммы $-$ эпсилон-жадный алгоритм. """)

st.markdown(
        """ ### Суть эпсилон-жадного алгоритма такова:
1. Случайным образом выбрать $k$ для n попыток.
2. На каждой попытке для каждого варианта оценить выигрыш.
3. После всех $n$ попыток:

    3.1. С вероятностью $(1 - e)$ выбрать $k$ с самым высоким выигрышем;
    
    3.2. С вероятностью $e$ выбрать $k$ случайно.
""")

st.markdown(
        """ 
### Преимущества метода:

1. Легкость в применении
2. Высокая эффективность в большинстве случаев
3. Эффективность метода не зависит от сезонности

### Из недостатков метода следует выделить:

1. Изменчивость стратегии
2. Открытый вопрос: стоит ли сокращать период изучения со временем?
""")