import streamlit as st


chart_visual = st.sidebar.radio('Содержание', 
    ('Главная', 'О Streamlit', 'Важные функции', 'Краткий обзор', 'Возможности Streamlit', 'Виджеты', 'Проблемы, которые решает Streamlit', 'Кеширование данных', 'Источники'))

if chart_visual == 'Главная':
    st.header('Streamlit')
    from PIL import Image
    image = Image.open('Streamlit.png')
    st.image(image)
    st.header('Студеникина Мария')
    st.header('Волкова Анна')
    st.header('Савкина Виктория')
  
if chart_visual == 'О Streamlit':
    st.header('О Streamlit')
    st.write('Streamlit — это библиотека Python с открытым исходным кодом для создания быстрых, производительных и красивых приложений для работы с данными.')

if chart_visual == 'Важные функции':
    st.header('Важные функции')
    st.markdown("""
    - Использование сценариев
    - Взаимодействие
    - Мгновенное развертывание
    """)

if chart_visual == 'Краткий обзор':
    st.header('Краткий обзор')
    st.write('И вот в октябре 2019 года в пользование выходит фреймворк Streamlit с открытым доступом, который упрощает визуализацию, изменение и обмен данными, устраняет множество барьеров в веб-интерфейсе и дизайне, незаменим в работе с моделями машинного обучения и анализом данных.')
    st.write('Целью создания данного продукта является переход на ступень выше в области машинного обучения, а также упрощение анализа обработки из мнения данных любого типа.')

if chart_visual == 'Возможности Streamlit':
    st.header('Возможности Streamlit')
    st.markdown("""
    - Легко загружать, создавать и обрабатывать данные
    - Кэширование данных
    - Визуализация данных
    - Множество виджетов
    """)

if chart_visual == 'Виджеты':
    st.header('Виджеты')
    st.markdown("""
    - Линейная диаграмма: streamlit.line_chart(/ваш датасет/)
    - Отображения точек данных на карте: streamlit.map(/ваш датасет/)
    - Отображение виджета с множественным выбором: streamlit.multiselect()
    - Отобразить виджет слайдера: streamlit.slider()
    - Отобразить виджет ползунка для выбора элементов из списка: streamlit.select_slider()
    - Боковая панель: streamlit.sidebar()
    """)

if chart_visual == 'Проблемы, которые решает Streamlit':
    st.header('С помощью Streamlit можно решить такие актуальные проблемы')
    st.markdown("""
    - Перевод бумажных архивов в датасеты
    - Развитие машинного обучения искусственного интеллекта
    - Цифровизация данных
    - Анализ и визуализация объемных данных
    """)

if chart_visual == 'Кеширование данных':
    st.header('Кеширование данных')
    st.write('Streamlit будет будут загружаться только один раз и кэшироваться для будущего использования.')
    st.write(' Основным ограничением кэширования данных Streamlit является то, что он не может отслеживать изменения данных, происходящие вне тела функции.')

if chart_visual == 'Источники':
    st.header('Источники.')
    st.write('Калмыков, М. Д. Возможности фреймворка Streamlit для созданий и развертывания интерактивных веб-приложений / М. Д. Калмыков // Актуальные вопросы эксплуатации систем охраны и защищенных телекоммуникационных систем : Сборник материалов Всероссийской научно-практической конференции, Воронеж, 10 июня 2021 года. – Воронеж: Воронежский институт Министерства внутренних дел Российской Федерации, 2021. – С. 19-21. – EDN UMGGLT.')
    st.write('https://github.com/pypa/get-pip')
    st.write('https://biconsult.ru/products/rukovodstvo-po-primeneniyu-streamlit-s-pomoshchyu-python')
    st.write('https://docs-python.ru/standart-library/modul-ensurepip-python/')
