import streamlit as st

st.set_page_config(page_title = "Постановка задачи")

st.sidebar.success("Постановка задачи")

st.write("# Постановка задачи")

st.write(r"""Выполнить программную реализацию алгоритмов MAB (равномерного, эпсилон-жадного (e-greedly), 
         верхней границы доверительного интервала (UCB) и алгоритма Томпсона). Провести численное исследование 
         асимптотических свойств, т.е. времени достижения Regret-функции стационарного значения, в зависимости 
         от параметров алгоритмов и взаимного соотношения заданных вероятностей конверсий рекламных баннеров.""")
