import streamlit as st

st.set_page_config(page_title = "Выводы")

st.sidebar.success("Выводы")

st.write("# Выводы")

st.markdown(
        """
Эпсиолон-жадный  является простым и быстрым алгоритмом, но более склонен к исследованию по сравнению с использованием данных. 

Алгоритм верхнего доверительного интервала и алгоритм Томсона более эффективны, так как они стремятся придерживаться лучших 
комбинаций исследования и использования данных.

Однако, выбор между эпсиолон-жадным, алгоритмом верхнего доверительного интервала и алгоритмом Томсона зависит от контекста и 
особенностей задачи. Некоторые задачи могут лучше подходить для одного из этих алгоритмов, в то время как другие задачи могут 
требовать комбинации этих алгоритмов или других стратегий выбора действий.

""")